CREATE DATABASE IF NOT EXISTS StudentsDB;
USE StudentsDB;

CREATE TABLE IF NOT EXISTS Students (
    ID INT AUTO_INCREMENT PRIMARY KEY,
    Last_Name VARCHAR(255),
    First_Name VARCHAR(255),
    Middle_Name VARCHAR(255),
    Date_of_Birth DATE,
    Student_ID VARCHAR(20)
);

INSERT INTO Students (Last_Name, First_Name, Middle_Name, Date_of_Birth, Student_ID) VALUES
('Іванов', 'Олександр', 'Михайлович', '1998-05-10', 'A123456789'),
('Петров', 'Ігор', 'Олегович', '1997-12-15', 'B987654321'),
('Сидоров', 'Марина', 'Володимирівна', '1999-08-20', 'C246813579'),
('Коваленко', 'Анна', 'Сергіївна', '2000-03-25', 'D159487623'),
('Семенчук', 'Дмитро', 'Ігорович', '1996-09-05', 'E753951824'),
('Григоренко', 'Ольга', 'Вікторівна', '1998-07-30', 'F369852147'),
('Білоус', 'Максим', 'Павлович', '1997-11-12', 'G258741369'),
('Шевченко', 'Юлія', 'Андріївна', '1999-04-18', 'H147258369'),
('Козлова', 'Наталія', 'Дмитрівна', '2001-01-22', 'I123987456'),
('Павлов', 'Іван', 'Васильович', '1995-07-07', 'J456321789'),
('Лисенко', 'Тетяна', 'Петрівна', '1996-08-15', 'K987654123'),
('Соколов', 'Олексій', 'Віталійович', '1998-09-20', 'L321654987'),
('Мельник', 'Олена', 'Іванівна', '1999-02-05', 'M654789321'),
('Коваль', 'Петро', 'Олегович', '1997-03-30', 'N987321654'),
('Мороз', 'Ірина', 'Володимирівна', '1996-11-25', 'O123456789'),
('Зайцев', 'Андрій', 'Павлович', '1998-07-12', 'P654987321'),
('Полякова', 'Олена', 'Михайлівна', '2000-04-28', 'Q321654987'),
('Ігнатенко', 'Віктор', 'Олександрович', '1999-10-15', 'R987654321'),
('Ткаченко', 'Юлія', 'Анатоліївна', '1997-05-20', 'S123456789'),
('Литвиненко', 'Олександр', 'Петрович', '1998-12-03', 'T456987321');


